<a href="https://colab.research.google.com/github/NayeonKeum/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/%5BPandas%5D%EB%8D%B0%EC%9D%B4%ED%84%B0_%EB%B6%84%EC%84%9D_%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [64]:
# 7강. 행, 열 생성 및 수정하기
import pandas as pd

friend_dict_list=[{'name':'Eunjae','age':'20', 'job':'chemist'},{'name':'Yoobin','age':'22', 'job':'engineer'},{'name':'Nayeon','age':'30', 'job':'developer'}]
df=pd.DataFrame(friend_dict_list, columns=['name','age','job'])

In [65]:
df.head()

     name age        job
0  Eunjae  20    chemist
1  Yoobin  22   engineer
2  Nayeon  30  developer

In [66]:
df['salary']=0
df.head()

     name age        job  salary
0  Eunjae  20    chemist       0
1  Yoobin  22   engineer       0
2  Nayeon  30  developer       0

In [67]:
import numpy as np

In [68]:
df['salary']=np.where(df['job']!='student', 'yes', 'no')

In [69]:
df.head()

     name age        job salary
0  Eunjae  20    chemist    yes
1  Yoobin  22   engineer    yes
2  Nayeon  30  developer    yes

In [70]:
friend_dict_list=[{'name':'Eunjae','midterm':87, 'final':89},{'name':'Yoobin','midterm':23, 'final':34},{'name':'Nayeon','midterm':95, 'final':90}]
df=pd.DataFrame(friend_dict_list, columns=['name','midterm','final'])

In [71]:
df.head()

     name  midterm  final
0  Eunjae       87     89
1  Yoobin       23     34
2  Nayeon       95     90

In [72]:
df['total']=df['midterm']+df['final']

In [73]:
df.head()

     name  midterm  final  total
0  Eunjae       87     89    176
1  Yoobin       23     34     57
2  Nayeon       95     90    185

In [74]:
df['average']=df['total']/2
df.head()

     name  midterm  final  total  average
0  Eunjae       87     89    176     88.0
1  Yoobin       23     34     57     28.5
2  Nayeon       95     90    185     92.5

In [76]:
grades=[]
for row in df['average']:
  if row>=85:
    grades.append('A')
  elif row>=60:
    grades.append('B')
  elif row>=35:
    grades.append('C')
  else:
    grades.append('F')
df['grade']=grades
df.head()

     name  midterm  final  total  average grade
0  Eunjae       87     89    176     88.0     A
1  Yoobin       23     34     57     28.5     F
2  Nayeon       95     90    185     92.5     A

In [77]:
def pass_or_fail(row):
  if row != 'F':
    return "Pass"
  else:
    return "Fail"
df.grade=df.grade.apply(pass_or_fail)
df.head()

     name  midterm  final  total  average grade
0  Eunjae       87     89    176     88.0  Pass
1  Yoobin       23     34     57     28.5  Fail
2  Nayeon       95     90    185     92.5  Pass

In [78]:
 date_list=[
            {'yyyy-mm-dd':'1999-09-03'},
            {'yyyy-mm-dd':'2000-01-16'},
            {'yyyy-mm-dd':'1999-10-03'}
 ]
 df=pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
 df.head()

   yyyy-mm-dd
0  1999-09-03
1  2000-01-16
2  1999-10-03

In [79]:
def extract_year(row):
  return row.split('-')[0]

df['year']=df['yyyy-mm-dd'].apply(extract_year)
df.head()

   yyyy-mm-dd  year
0  1999-09-03  1999
1  2000-01-16  2000
2  1999-10-03  1999

In [80]:
friend_dict_list=[{'name':'Eunjae','midterm':87, 'final':89},{'name':'Yoobin','midterm':23, 'final':34},{'name':'Nayeon','midterm':95, 'final':90}]
df=pd.DataFrame(friend_dict_list, columns=['name','midterm','final'])
df.head()

     name  midterm  final
0  Eunjae       87     89
1  Yoobin       23     34
2  Nayeon       95     90

In [81]:
df2=pd.DataFrame([
                  ['Ben', 50, 50]
                  ], columns=['name', 'midterm', 'final'])
df2.head()

  name  midterm  final
0  Ben       50     50

In [82]:
df.append(df2, ignore_index=True)

     name  midterm  final
0  Eunjae       87     89
1  Yoobin       23     34
2  Nayeon       95     90
3     Ben       50     50

In [1]:
# 8강.열 정보로 데이터 그룹 생성하기

In [2]:
import pandas as pd

In [5]:
student_list=[{'name':'John', 'major':'Computer Science','sex':'male'},
              {'name':'Eunjae', 'major':'Chemistry','sex':'female'},
              {'name':'Yoobin', 'major':'Electronic Engineering','sex':'female'},
              {'name':'Heewon', 'major':'Brain Science','sex':'female'},
              {'name':'Hyewon', 'major':'Nursery','sex':'female'},
              {'name':'Jeanie', 'major':'Free major','sex':'female'},
              {'name':'Nayeon', 'major':'Computer Science','sex':'female'},
              {'name':'Jason', 'major':'Economics','sex':'male'},
              {'name':'Edward', 'major':'Economics','sex':'male'},
              {'name':'Freidrich', 'major':'Computer Science','sex':'male'},
              {'name':'Georg', 'major':'Computer Science','sex':'male'},
              ]
df=pd.DataFrame(student_list,columns=['name', 'major', 'sex'])
df

         name                   major     sex
0        John        Computer Science    male
1      Eunjae               Chemistry  female
2      Yoobin  Electronic Engineering  female
3      Heewon           Brain Science  female
4      Hyewon                 Nursery  female
5      Jeanie              Free major  female
6      Nayeon        Computer Science  female
7       Jason               Economics    male
8      Edward               Economics    male
9   Freidrich        Computer Science    male
10      Georg        Computer Science    male

In [6]:
groupby_major=df.groupby('major')
groupby_major.groups

{'Brain Science': Int64Index([3], dtype='int64'),
 'Chemistry': Int64Index([1], dtype='int64'),
 'Computer Science': Int64Index([0, 6, 9, 10], dtype='int64'),
 'Economics': Int64Index([7, 8], dtype='int64'),
 'Electronic Engineering': Int64Index([2], dtype='int64'),
 'Free major': Int64Index([5], dtype='int64'),
 'Nursery': Int64Index([4], dtype='int64')}

In [7]:
for name, group in groupby_major:
  print(name+":"+str(len(group)))
  print(group)
  print()

Brain Science:1
     name          major     sex
3  Heewon  Brain Science  female

Chemistry:1
     name      major     sex
1  Eunjae  Chemistry  female

Computer Science:4
         name             major     sex
0        John  Computer Science    male
6      Nayeon  Computer Science  female
9   Freidrich  Computer Science    male
10      Georg  Computer Science    male

Economics:2
     name      major   sex
7   Jason  Economics  male
8  Edward  Economics  male

Electronic Engineering:1
     name                   major     sex
2  Yoobin  Electronic Engineering  female

Free major:1
     name       major     sex
5  Jeanie  Free major  female

Nursery:1
     name    major     sex
4  Hyewon  Nursery  female

In [9]:
df_major_cnt=pd.DataFrame({'count':groupby_major.size()}).reset_index()#행,열 바꾸기
df_major_cnt

                    major  count
0           Brain Science      1
1               Chemistry      1
2        Computer Science      4
3               Economics      2
4  Electronic Engineering      1
5              Free major      1
6                 Nursery      1

In [10]:
groupby_sex=df.groupby('sex')
for name, group in groupby_sex:
  print(name+":"+str(len(group)))
  print(group)
  print()

female:6
     name                   major     sex
1  Eunjae               Chemistry  female
2  Yoobin  Electronic Engineering  female
3  Heewon           Brain Science  female
4  Hyewon                 Nursery  female
5  Jeanie              Free major  female
6  Nayeon        Computer Science  female

male:5
         name             major   sex
0        John  Computer Science  male
7       Jason         Economics  male
8      Edward         Economics  male
9   Freidrich  Computer Science  male
10      Georg  Computer Science  male

In [11]:
# 9강. 중복 데이터 삭제하기

In [4]:
import pandas as pd
student_list=[{'name':'John', 'major':'Computer Science','sex':'male'},
              {'name':'Eunjae', 'major':'Chemistry','sex':'female'},
              {'name':'Yoobin', 'major':'Electronic Engineering','sex':'female'},
              {'name':'Heewon', 'major':'Brain Science','sex':'female'},
              {'name':'Hyewon', 'major':'Nursery','sex':'female'},
              {'name':'Jeanie', 'major':'Free major','sex':'female'},
              {'name':'Nayeon', 'major':'Computer Science','sex':'female'},
              {'name':'Jason', 'major':'Economics','sex':'male'},
              {'name':'Edward', 'major':'Economics','sex':'male'},
              {'name':'Georg', 'major':'Computer Science','sex':'male'},
              {'name':'Georg', 'major':'Computer Science','sex':'male'},
              ]
df=pd.DataFrame(student_list,columns=['name', 'major', 'sex'])
df

      name                   major     sex
0     John        Computer Science    male
1   Eunjae               Chemistry  female
2   Yoobin  Electronic Engineering  female
3   Heewon           Brain Science  female
4   Hyewon                 Nursery  female
5   Jeanie              Free major  female
6   Nayeon        Computer Science  female
7    Jason               Economics    male
8   Edward               Economics    male
9    Georg        Computer Science    male
10   Georg        Computer Science    male

In [5]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

In [6]:
df.drop_duplicates()

     name                   major     sex
0    John        Computer Science    male
1  Eunjae               Chemistry  female
2  Yoobin  Electronic Engineering  female
3  Heewon           Brain Science  female
4  Hyewon                 Nursery  female
5  Jeanie              Free major  female
6  Nayeon        Computer Science  female
7   Jason               Economics    male
8  Edward               Economics    male
9   Georg        Computer Science    male

In [14]:
student_list=[{'name':'Jason', 'major':'Computer Science','sex':'male'},
              {'name':'Eunjae', 'major':'Chemistry','sex':'female'},
              {'name':'Yoobin', 'major':'Electronic Engineering','sex':'female'},
              {'name':'Heewon', 'major':'Brain Science','sex':'female'},
              {'name':'Hyewon', 'major':'Nursery','sex':'female'},
              {'name':'Jeanie', 'major':'Free major','sex':'female'},
              {'name':'Nayeon', 'major':'Computer Science','sex':'female'},
              {'name':'Jason', 'major':'Economics','sex':'male'},
              {'name':'Edward', 'major':'Economics','sex':'male'},
              {'name':'Georg', 'major':'Computer Science','sex':'male'},
              {'name':'Georg', 'major':'Economics','sex':'male'},
              ]
df=pd.DataFrame(student_list,columns=['name', 'major', 'sex'])

In [15]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7      True
8     False
9     False
10     True
dtype: bool

In [17]:
df.drop_duplicates(['name'], keep='last')

      name                   major     sex
1   Eunjae               Chemistry  female
2   Yoobin  Electronic Engineering  female
3   Heewon           Brain Science  female
4   Hyewon                 Nursery  female
5   Jeanie              Free major  female
6   Nayeon        Computer Science  female
7    Jason               Economics    male
8   Edward               Economics    male
10   Georg               Economics    male

In [18]:
# 10강 NaN 찾아서 다른 값으로 변경하기

In [26]:
school_id_list=[{'name':'Eunjae','age':20, 'job':'student'},
                {'name':'Yoobin','age':22, 'job':'student'},
                {'name':'Nayeon','age':30, 'job':'student'},
                {'name':'Billy','age':11, 'job':'student'},
                {'name':'Nate','age':40, 'job':'teacher'},
                {'name':'Jeanie','age':17, 'job':'student'},
                {'name':'Brigitte','age':None, 'job':'teacher'},
                {'name':'Mina','age':None, 'job':'teacher'}]
df=pd.DataFrame(school_id_list, columns = ['name','age','job'])
df

       name   age      job
0    Eunjae  20.0  student
1    Yoobin  22.0  student
2    Nayeon  30.0  student
3     Billy  11.0  student
4      Nate  40.0  teacher
5    Jeanie  17.0  student
6  Brigitte   NaN  teacher
7      Mina   NaN  teacher

In [27]:
df.shape

(8, 3)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   age     6 non-null      float64
 2   job     8 non-null      object
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [30]:
df.isna()

    name    age    job
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False   True  False
7  False   True  False

In [31]:
df.isnull()

    name    age    job
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False   True  False
7  False   True  False

In [33]:
df.age=df.age.fillna(0)
df

       name   age      job
0    Eunjae  20.0  student
1    Yoobin  22.0  student
2    Nayeon  30.0  student
3     Billy  11.0  student
4      Nate  40.0  teacher
5    Jeanie  17.0  student
6  Brigitte   0.0  teacher
7      Mina   0.0  teacher

In [41]:
school_id_list=[{'name':'Eunjae','age':20, 'job':'student'},
                {'name':'Yoobin','age':22, 'job':'student'},
                {'name':'Nayeon','age':30, 'job':'student'},
                {'name':'Billy','age':11, 'job':'student'},
                {'name':'Nate','age':40, 'job':'teacher'},
                {'name':'Jeanie','age':17, 'job':'student'},
                {'name':'Brigitte','age':None, 'job':'teacher'},
                {'name':'Mina','age':None, 'job':'student'}]
df=pd.DataFrame(school_id_list, columns = ['name','age','job'])

In [42]:
df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace = True)#해당그룹의 평균 값
df

       name   age      job
0    Eunjae  20.0  student
1    Yoobin  22.0  student
2    Nayeon  30.0  student
3     Billy  11.0  student
4      Nate  40.0  teacher
5    Jeanie  17.0  student
6  Brigitte  40.0  teacher
7      Mina  20.0  student

In [43]:
#11강. apply 함수(행열추가), 다양한 예제로 활용해보기

In [44]:
 date_list=[{'yyyy-mm-dd':'1999-09-03'},
            {'yyyy-mm-dd':'2000-01-16'},
            {'yyyy-mm-dd':'1999-10-03'}
 ]
 df=pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
 df

   yyyy-mm-dd
0  1999-09-03
1  2000-01-16
2  1999-10-03

In [47]:
def extract_year(column):
  return column.split("-")[0]
df['year']=df['yyyy-mm-dd'].apply(extract_year)# 모든 row에 컬럼 하나씩
df

   yyyy-mm-dd  year
0  1999-09-03  1999
1  2000-01-16  2000
2  1999-10-03  1999

In [48]:
def get_age(year, current_year):
  return current_year - int(year)
df['age']=df['year'].apply(get_age, current_year=2018)
df

   yyyy-mm-dd  year  age
0  1999-09-03  1999   19
1  2000-01-16  2000   18
2  1999-10-03  1999   19

In [49]:
def get_introduce(age, prefix, suffix):
  return prefix+str(age)+suffix
df['introduce']=df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")
df

   yyyy-mm-dd  year  age          introduce
0  1999-09-03  1999   19  I am 19 years old
1  2000-01-16  2000   18  I am 18 years old
2  1999-10-03  1999   19  I am 19 years old

In [52]:
def get_introduce_2(row):
  return "I was born in "+str(row.year)+" my age is "+str(row.age)
df.introduce=df.apply(get_introduce_2, axis=1)#df['introduce_2']하면 두 개 뜸
df

   yyyy-mm-dd  year  age                        introduce
0  1999-09-03  1999   19  I was born in 1999 my age is 19
1  2000-01-16  2000   18  I was born in 2000 my age is 18
2  1999-10-03  1999   19  I was born in 1999 my age is 19

In [53]:
#12강. map, applymap 함수, 다양한 예제로 활용해보기

In [66]:
 date_list=[{'date':'1999-09-03'},
            {'date':'2000-01-16'},
            {'date':'1999-10-03'}
 ]
 df=pd.DataFrame(date_list, columns=['date'])
 df

         date
0  1999-09-03
1  2000-01-16
2  1999-10-03

In [69]:
def extract_year(date):
  return date.split("-")[0]
df['year']=df['date'].map(extract_year)
df

         date  year
0  1999-09-03  1999
1  2000-01-16  2000
2  1999-10-03  1999

In [75]:
job_list=[{'age':20, 'job':'chemist'},
               {'age':22, 'job':'engineer'},
               {'age':30, 'job':'developer'}]
df=pd.DataFrame(job_list)
df

   age        job
0   20    chemist
1   22   engineer
2   30  developer

In [76]:
df.job=df.job.map({'chemist':1, "developer":2, "engineer":3})
df

   age  job
0   20    1
1   22    3
2   30    2

In [77]:
x_y=[{'x':5.5,'y':-5.6,'z':-1.1},
     {'x':-5.2,'y':5.5,'z':-2.2},
     {'x':-1.6,'y':-4.5,'z':-3.3},
     ]
df=pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [78]:
import numpy as np

In [79]:
df=df.applymap(np.around)
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [80]:
#13강. unique, value_counts 컬럼 내 유니크한 값 뽑아내고 갯수 확인하기

In [83]:
job_list=[{'name':'Jason', 'job':'teacher'},
              {'name':'Eunjae', 'job':'Chemist'},
              {'name':'Yoobin', 'job':'Engineer'},
              {'name':'Heewon', 'job':'Pharmacy'},
              {'name':'Hyewon', 'job':'Nurse'},
              {'name':'Jeanie', 'job':'Economist'},
              {'name':'Nayeon', 'job':'developer'},
              {'name':'Jason', 'job':'developer'},
              {'name':'Edward', 'job':'teacher'},
              {'name':'Georg', 'job':'teacher'},
              {'name':'Georg', 'job':'developer'},
              ]
df=pd.DataFrame(job_list,columns=['name', 'job'])

In [84]:
df.job.unique()#종류별 하나씩

array(['teacher', 'Chemist', 'Engineer', 'Pharmacy', 'Nurse', 'Economist',
       'developer'], dtype=object)

In [85]:
df.job.value_counts()

teacher      3
developer    3
Pharmacy     1
Engineer     1
Chemist      1
Nurse        1
Economist    1
Name: job, dtype: int64

In [86]:
#14강. 두개의 데이터프레임 합치기

In [102]:
l1=[{'name':'Jason', 'job':'teacher'},
    {'name':'Eunjae', 'job':'Chemist'},
    {'name':'Yoobin', 'job':'Engineer'},
    {'name':'Heewon', 'job':'Pharmacy'},
    ]
l2=[{'name':'Hyewon', 'job':'Nurse'},
    {'name':'Jeanie', 'job':'Economist'},
    {'name':'Nayeon', 'job':'developer'},
    {'name':'Jason', 'job':'developer'},
    ]

df1=pd.DataFrame(l1,columns=['name', 'job'])
df2=pd.DataFrame(l2,columns=['name', 'job'])

In [93]:
result=pd.concat([df1,df2], ignore_index=True)#index수정
result

     name        job
0   Jason    teacher
1  Eunjae    Chemist
2  Yoobin   Engineer
3  Heewon   Pharmacy
4  Hyewon      Nurse
5  Jeanie  Economist
6  Nayeon  developer
7   Jason  developer

In [96]:
result=df1.append(df2, ignore_index=True)
result

     name        job
0   Jason    teacher
1  Eunjae    Chemist
2  Yoobin   Engineer
3  Heewon   Pharmacy
4  Hyewon      Nurse
5  Jeanie  Economist
6  Nayeon  developer
7   Jason  developer

In [105]:
l3=[{'name':'Edward', 'job':'teacher'},
     {'name':'Georg', 'job':'teacher'},
     {'name':'Jacl', 'job':'developer'},
    ]
l4=[{'age':25,'country':"US"},
    {'age':30,'country':"UK"},
    {'age':45,'country':"Korea"},
    ]
df1=pd.DataFrame(l3, columns=['name', 'job'])
df2=pd.DataFrame(l4, columns=['age','country'])

In [106]:
result=pd.concat([df1,df2],axis=1, ignore_index=True)#열로 넣어라
result

        0          1   2      3
0  Edward    teacher  25     US
1   Georg    teacher  30     UK
2    Jacl  developer  45  Korea

In [107]:
label=[1,2,3,4,5]
prediction=[1,2,2,4,4]
comparison=pd.DataFrame({'label':label, 'prediction':prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4